sim-transient/system/volumeAverageFunctions.in
box_000
{ 
	 type 	 volFieldValue; 
	 libs 	 (fieldFunctionObjects); 
	 writeControl 	 timeStep; 
	 writeInterval 	 1; 
	 writeFields 	 false; 
	 regionType 	 cellZone; 
	 name 	 box_000;
	 operation 	 volIntegrate; 
	 fields 
	( 
	 	 U 
	 	 p 
	 	 div_u 
	 	 div_stress_term_dev 
	 	 div_stress_term_dev_macro 
	 ); 
} 
 
